ADDA_COmpareResults/SOAP_APIs/headers/getDrivingLicenseInformation.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:ae:gov:abudhabi:DigitalDocuments:DrivingLicenseMessages:1" xmlns:urn1="urn:ae:gov:abudhabi:DigitalDocuments:DrivingLicenseTypes:1">
   <soapenv:Header>
      <urn:RequestTrnHeader>
         <!--Optional:-->
         <urn1:EntityCode>ADP</urn1:EntityCode>
      </urn:RequestTrnHeader>
   </soapenv:Header>
   <soapenv:Body>
      <urn:DrivingLicenseInformationRequest>
         <!--You have a CHOICE of the next 4 items at this level-->
         <urn:EmiratesID>123654789</urn:EmiratesID>
         <urn:LicenseNumber>963258741</urn:LicenseNumber>
         <urn:LicenseSourceCode>ADDA</urn:LicenseSourceCode>
         <urn:TrafficNumber>12345</urn:TrafficNumber>
         <urn:UnifiedNumber>098765</urn:UnifiedNumber>
         <urn:SecurityCredentials>
            <urn:UserName>username</urn:UserName>
            <urn:Password>password</urn:Password>
         </urn:SecurityCredentials>
      </urn:DrivingLicenseInformationRequest>
   </soapenv:Body>
</soapenv:Envelope>